# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
#brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'z'

# Development

# Apps
cask '1password'
cask 'alfred'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'firefoxnightly'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iterm2'
cask 'imageoptim'
cask 'karabiner-elements'
cask 'liteicon'
cask 'numi'
cask 'opera'
cask 'opera-neon'
cask 'pocket-casts'
cask 'slack'
cask 'bartender'
cask 'dropbox'
cask 'encryptme'
cask 'fantastical'
cask 'skyfonts'
cask 'sketch'
cask 'spectacle'
cask 'spotify'
cask 'visual-studio-code'
cask 'visual-studio-code-insiders'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Giphy Capture', id: 668208984
mas 'Amphetamine', id: 937984704
mas 'Memory Clean 2 - Monitor and Free Up Memory', id: 1114591412
mas 'Things 3', id: 904280696
mas 'Todoist: Organize your life', id: 585829637
